&emsp;&emsp; 1. Знайти середню, мінімальну і максимальну вартість квитка в залежності від місця посадки і класу каюти (`Титанік`)

In [14]:
import pandas as pd
import numpy as np

titanic_data = pd.read_csv(
    '../Lessons/Lesson 5/Files/TitanicDataset.csv',
    sep=',',
    header=0)

aggr_data = titanic_data.groupby(by=['Embarked', 'Pclass']).agg(
    mean_fare=('Fare', np.mean),
    min_fare=('Fare', np.min),
    max_fare=('Fare', np.max)
)
aggr_data

                  mean_fare  min_fare  max_fare
Embarked Pclass
C        1       104.718529   26.5500  512.3292
         2        25.358335   12.0000   41.5792
         3        11.214083    4.0125   22.3583
Q        1        90.000000   90.0000   90.0000
         2        12.350000   12.3500   12.3500
         3        11.183393    6.7500   29.1250
S        1        70.364862    0.0000  263.0000
         2        20.327439    0.0000   73.5000
         3        14.644083    0.0000   69.5500

&emsp;&emsp; 2. Змінити пропущені значення віку на середнє, в залежності від статі і класу каюти (`Титанік`)


&emsp;&emsp; 3. Найти загальну суму продажу по місяцях 2019-го року; вивести в форматі місяця - сума в порядку збільшення суми (`Sales`)


&emsp;&emsp; 4. Знайти всіх виконавців, у яких понад 10 альбомів (`chinook/albums`)


&emsp;&emsp; 5. Виберіть всю інформацію по інвойсам, суму яких у 3 рази вище середнього значення (`chinook/invoices`)